# BorderAroundSchedule Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..BorderAroundSchedule Property
PanelScheduleData Class See Also
---
Places a border (GraphicStyle element) around the entire schedule, visible only on the instance and sheet
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId BorderAroundSchedule { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BorderAroundSchedule As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ BorderAroundSchedule {
	ElementId^ get ();
}
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace